[
  {
    "name": "Sýrová pizza",
    "description": "1.\tPředehřejte troubu na 220 stupňů Celsia.\n2.\tRozválejte tenké těsto na pizzu na pečícím papíru a přeneste ho na plech.\n3.\tRozetřete česnekový základ po povrchu těsta.\n4.\tNa česnekový základ rozložte dušenou šunku.\n5.\tPřidejte plátky sýru Gouda, mozzarelly a Eidamu.\n6.\tPotřete pizzu olivovým olejem.\n7.\tPečte pizzu v předehřáté troubě po dobu 12-15 minut, nebo dokud těsto nezačne zlatě hnědnout.\n8.\tVyjměte pizzu z trouby a posypte ji čerstvou bazalkou.\n9.\tNechte pizzu lehce vychladnout a poté ji nakrájejte na porce.\n\nAť vám chutná!\n",
    "imageUrl": "https://kitchenatics.com/wp-content/uploads/2020/09/Cheese-pizza-1.jpg",
    "preparationLength": 40,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "fc1fb9b9f4766e63",
        "amount": 150,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 100,
        "units": "ml"
      },
      {
        "id": "bae451dfe73e2b1f",
        "amount": 200,
        "units": "g"
      },
      {
        "id": "b5029fee70f9c339",
        "amount": 50,
        "units": "g"
      },
      {
        "id": "f02fc2f5d73abeb8",
        "amount": 50,
        "units": "g"
      },
      {
        "id": "d918f6f90fbcfe0a",
        "amount": 50,
        "units": "g"
      },
      {
        "id": "1fb3aa7708b7100a",
        "amount": 35,
        "units": "ml"
      },
      {
        "id": "197d1ac57738f812",
        "amount": 50,
        "units": "g"
      }
    ],
    "_id": "bbe820894682e286"
  },
  {
    "name": "Pepperoni pizza",
    "description": "1.\tPředehřejte troubu na teplotu 220°C.\n2.\tRozprostřete tenké pizzové těsto na plech vyložený pečicím papírem. Pokud máte oblíbený recept na těsto, můžete jej připravit sami, nebo použít hotové těsto z obchodu.\n3.\tNa těsto nanesete česnekový základ. Můžete jej vyrobit smícháním česnekové pasty nebo nasekaného česneku s olivovým olejem.\n4.\tRozložte plátky pepperoni po celé ploše těsta. Pepperoni jsou pikantní italské salámové plátky, které dodají pizze výraznou chuť.\n5.\tPosypte pizzu strouhaným sýrem Mozzarella. Sýr Mozzarella je klasickým sýrem pro pizzu, který se v troubě dobře rozpustí a vytvoří krémovou a sytou vrstvu.\n6.\tNa závěr posypte drceným česnekem pro výraznější chuť a aromat.\n7.\tPizzu pečte v předehřáté troubě přibližně 12-15 minut, nebo dokud nebude těsto zlatavé a sýr rozpuštěný a lehce zřízne.\n8.\tVyjměte pizzu z trouby, nechte ji chvíli vychladnout a poté ji nakrájejte na kousky.\nVaše tenká česky pizza s pepperoni, sýrem Mozzarella a drceným česnekem je hotová k podávání. Dobrou chuť!\n",
    "imageUrl": "https://www.recipetineats.com/wp-content/uploads/2020/05/Pepperoni-Pizza_7.jpg?resize=650,910",
    "preparationLength": 50,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "fc1fb9b9f4766e63",
        "amount": 250,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 100,
        "units": "ml"
      },
      {
        "id": "9efa21b2a7dacfe4",
        "amount": 75,
        "units": "g"
      },
      {
        "id": "f02fc2f5d73abeb8",
        "amount": 50,
        "units": "g"
      },
      {
        "id": "d479bad2efd87ce9",
        "amount": 15,
        "units": "g"
      }
    ],
    "_id": "20c764dc537f9dbd"
  },
  {
    "name": "Quattro Formaggi pizza",
    "description": "1.\tPředehřejte troubu na teplotu 220 stupňů Celsia.\n2.\tPoložte tenké těsto na pečící plech vyložený pečicím papírem nebo potřený olejem.\n3.\tRozetřete česnekový základ na tenkém těstě. Můžete použít čerstvý česnek nebo česnekovou pastu smíchanou s olivovým olejem.\n4.\tNa česnekový základ přidejte sýr Gouda, sýr Cheddar, sýr Eidam a sýr Mozzarella. Můžete je nastrouhat nebo nakrájet na tenké plátky.\n5.\tPosypte pizzu čerstvou bazalkou.\n6.\tVložte plech s pizzou do předehřáté trouby a pečte asi 12-15 minut, nebo dokud se sýr na pizzě neroztaví a těsto nezezlátne.\n7.\tVyjměte pizzu z trouby a nechte ji lehce vychladnout. Poté ji můžete nakrájet a podávat.\nTento recept je přibližný a můžete ho upravit podle svých preferencí. Můžete přidat další ingredience, jako jsou rajčatové plátky, olivy nebo sušené bylinky, aby se pizza lépe hodila k vašemu vkusu. Dobrou chuť!\n",
    "imageUrl": "https://cdn.tasteatlas.com/images/recipes/946f07b7b5ec4f23a6fea58a2ac72650.jpg",
    "preparationLength": 45,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "fc1fb9b9f4766e63",
        "amount": 150,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 100,
        "units": "ml"
      },
      {
        "id": "b5029fee70f9c339",
        "amount": 90,
        "units": "g"
      },
      {
        "id": "b8c55f234035edbb",
        "amount": 90,
        "units": "g"
      },
      {
        "id": "d918f6f90fbcfe0a",
        "amount": 90,
        "units": "g"
      },
      {
        "id": "f02fc2f5d73abeb8",
        "amount": 90,
        "units": "g"
      },
      {
        "id": "197d1ac57738f812",
        "amount": 25,
        "units": "ml"
      }
    ],
    "_id": "d3e4672695c7179f"
  },
  {
    "name": "Šunková pizza",
    "description": "1.\tPředehřejte troubu na 220 stupňů Celsia.\n2.\tNa vále vyválejte tenké těsto na velikost vaší pekáčku na pizzu. Pokud nemáte pekáček na pizzu, můžete použít pečicí plech s pečícím papírem.\n3.\tNamažte těsto kečupovým základem. Použijte asi 2-3 lžíce kečupu a rovnoměrně ho rozetřete po celé ploše těsta.\n4.\tNa těsto rozložte dušenou šunku. Můžete ji nakrájet na menší kousky nebo ji roztrhat na proužky.\n5.\tPřidejte na pizzu houby. Můžete použít čerstvé nebo konzervované houby. Pokud jsou čerstvé, doporučuje se je předem osmahnout na pánvi.\n6.\tPosypte pizzu strouhaným sýrem Parmezánem. Sýr můžete rovnoměrně rozložit po celé ploše pizzy.\n7.\tPizzu dejte do předehřáté trouby a pečte ji asi 10-15 minut, nebo dokud těsto není zlatavé a sýr nezačne rozplývat.\n8.\tPo upečení vyjměte pizzu z trouby a nechte ji lehce vychladnout. Poté ji můžete nakrájet na kousky a podávat.\nŠunková pizza s tenkým těstem je skvělou volbou pro rychlý a chutný oběd nebo večeři. Můžete ji také libovolně upravit dle svých představ přidáním dalších ingrediencí, jako jsou rajčata, paprika nebo olivy. Dobrou chuť!\n",
    "imageUrl": "https://2065603294.s1.eshop-rychle.cz/fotky87366/fotos/_vyr_2_DSCN7654.jpg",
    "preparationLength": 55,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "fc1fb9b9f4766e63",
        "amount": 150,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 100,
        "units": "ml"
      },
      {
        "id": "bae451dfe73e2b1f",
        "amount": 100,
        "units": "g"
      },
      {
        "id": "bb6f1b175336394c",
        "amount": 75,
        "units": "g"
      },
      {
        "id": "55cab6d8e9933ee5",
        "amount": 50,
        "units": "g"
      }
    ],
    "_id": "ffb3d299365552b3"
  },
  {
    "name": "Pikantní salámová pizza",
    "description": "1.\tPředehřejte troubu na teplotu 220 °C.\n2.\tRozválejte tlusté těsto na pizzu a přeneste ho na plech vyložený pečícím papírem.\n3.\tRozetřete česnekový základ nebo omáčku po celé ploše těsta.\n4.\tRozložte plátky pepperoni salámu a pikantního salámu po povrchu těsta.\n5.\tRozprostřete nasekané chili papričky rovnoměrně na pizzu.\n6.\tPřidejte nakrájená rajčata na plátky.\n7.\tPečte pikantní salámovou pizzu v předehřáté troubě po dobu asi 12-15 minut, nebo dokud není těsto zlatavé a křupavé.\n8.\tVyjměte pizzu z trouby a nechte ji chvíli vychladnout.\n9.\tNakrájejte na plátky a servírujte ještě teplou.\nTento recept je určený pro jednu salámovou pizzu, ale můžete ho přizpůsobit svým preferencím a množství ingrediencí dle potřeby. Doufám, že vám bude chutnat! Dobrou chuť!\n",
    "imageUrl": "https://ms3.ostium.cz/instance/web-recepty/jomUyV7H/h389w574t.jpg",
    "preparationLength": 45,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "a427c896a6df2d21",
        "amount": 250,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 100,
        "units": "ml"
      },
      {
        "id": "9efa21b2a7dacfe4",
        "amount": 75,
        "units": "g"
      },
      {
        "id": "eccce1f42cebdb62",
        "amount": 100,
        "units": "g"
      },
      {
        "id": "eccqe1f42cebdb61",
        "amount": 25,
        "units": "g"
      },
      {
        "id": "45496923913e5e34",
        "amount": 50,
        "units": "g"
      }
    ],
    "_id": "18183dc882180565"
  },
  {
    "name": "Hawaii pizza",
    "description": "1.\tPředehřejte troubu na 220 stupňů Celsia.\n2.\tRozložte tenké pizzové těsto na plech vyložený pečicím papírem.\n3.\tNalijte česnekový základ na těsto a rovnoměrně ho rozetřete.\n4.\tNa česnekový základ rozložte dušenou šunku a salám Godhai (nebo jiný salám).\n5.\tNa vrch posypte nastrouhaný sýr Cheddar (nebo mozzarellu).\n6.\tNakonec přidejte kousky ananasu rovnoměrně rozložené po pizze.\n7.\tPizzu dejte do předehřáté trouby a pečte přibližně 12-15 minut, nebo dokud těsto nezíská zlatavou barvu a sýr neroztaje a nezačne se lehce hnědit.\n8.\tJakmile je pizza hotová, vyjměte ji z trouby a nechte chvíli vychladnout.\n9.\tNakrájejte na porce a podávejte ještě teplé.\nDobrou chuť!\n",
    "imageUrl": "https://www.jessicagavin.com/wp-content/uploads/2020/07/hawaiian-pizza-16-1200.jpg",
    "preparationLength": 45,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "fc1fb9b9f4766e63",
        "amount": 150,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 75,
        "units": "ml"
      },
      {
        "id": "bae451dfe73e2b1f",
        "amount": 90,
        "units": "g"
      },
      {
        "id": "eccce1f42cebdb61",
        "amount": 75,
        "units": "g"
      },
      {
        "id": "b8c55f234035edbb",
        "amount": 80,
        "units": "g"
      },
      {
        "id": "eccde1f42cebdb61",
        "amount": 50,
        "units": "g"
      }
    ],
    "_id": "0586c0e4549e1b72"
  },
  {
    "name": "Pizza s kuřecím masem",
    "description": "1.\tPředehřejte troubu na 220 °C.\n2.\tRozválejte tenké pizzové těsto na plech vyložený pečicím papírem nebo do olejem vymazané formy.\n3.\tRozetřete česnekový základ rovnoměrně po povrchu těsta. Můžete ho připravit smícháním čerstvého česneku s olivovým olejem a solí.\n4.\tNa česnekový základ rozložte nakrájené kuřecí maso. Rozprostřete ho rovnoměrně po povrchu těsta.\n5.\tPřidejte kukuřici. Můžete ji rovnoměrně posypat po celém povrchu pizzy.\n6.\tNa závěr posypte sýrem Parmezánem. Opět rovnoměrně rozložte po povrchu pizzy.\n7.\tPizzu vložte do předehřáté trouby a pečte asi 12-15 minut nebo dokud těsto nezezlátne a sýr nezačne lehce hnědnout.\n8.\tVyjměte pizzu z trouby a nechte ji chvíli vychladnout. Poté ji nakrájejte na plátky a podávejte.\nTímto způsobem získáte vynikající pizzu s kuřecím masem, kukuřicí a sýrem Parmezánem. Dobrou chuť!\n",
    "imageUrl": "https://storcpdkenticomedia.blob.core.windows.net/media/recipemanagementsystem/media/recipe-media-files/recipes/retail/x17/2014_garlic-chicken-pizza_600x600.jpg?ext=.jpg",
    "preparationLength": 55,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "fc1fb9b9f4766e63",
        "amount": 150,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 100,
        "units": "ml"
      },
      {
        "id": "0bab7fc76454d164",
        "amount": 120,
        "units": "g"
      },
      {
        "id": "4fa36e918906abd8",
        "amount": 50,
        "units": "g"
      },
      {
        "id": "bb6f1b175336394c",
        "amount": 75,
        "units": "g"
      }
    ],
    "_id": "d2268e1bab45dab3"
  },
  {
    "name": "Vegetariánská pizza",
    "description": "1.\tPředehřejte troubu na 220°C.\n2.\tRozprostřete tenké pizzové těsto na plech vyložený pečícím papírem nebo na pizzovou pánev.\n3.\tRozetřete česnekový základ na těsto. Můžete použít česnekový olej nebo promíchat česnek s olivovým olejem a přidat špetku soli.\n4.\tNa rozetřený česnekový základ rozložte tenké plátky cibule.\n5.\tPřidejte na pizzu olivy, které můžete nakrájet na kolečka nebo půlky.\n6.\tNa závěr přidejte na pizzu plátky papriky. Můžete použít červenou, žlutou nebo zelenou papriku, podle vaší preference.\n7.\tPizza je připravená k pečení. Dejte ji do předehřáté trouby a pečte přibližně 10-12 minut, nebo dokud těsto nezačne zlatě hnědnout a paprika a cibule nejsou mírně zkaramelizované.\n8.\tVyjměte pizzu z trouby a nechte ji chvíli vychladnout. Poté ji můžete nakrájet na plátky a podávat.\nTento recept je základní a můžete ho dle svých preferencí upravit. Můžete přidat další zeleninu, jako je například rajčata, houby nebo špenát. Přidání sýra (např. mozzarella nebo sýr feta) je také možností pro větší sytost. Nezapomeňte však, že v tom případě už nebude pizza veganská.\n",
    "imageUrl": "https://i0.wp.com/www.thursdaynightpizza.com/wp-content/uploads/2022/06/veggie-pizza-side-view-out-of-oven.png?resize=720%2C480&ssl=1",
    "preparationLength": 40,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "fc1fb9b9f4766e63",
        "amount": 125,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 75,
        "units": "ml"
      },
      {
        "id": "eccde1f42cebdb69",
        "amount": 50,
        "units": "g"
      },
      {
        "id": "f51557d62c2c1f56",
        "amount": 40,
        "units": "g"
      },
      {
        "id": "259346667035a9db",
        "amount": 40,
        "units": "g"
      }
    ],
    "_id": "144559a870b5095c"
  },
  {
    "name": "Margherita pizza",
    "description": "1.\tNejprve si připravte tenké těsto na pizzu. Můžete si ho buď koupit hotové, nebo si vyrobit vlastní. Existuje mnoho receptů na tenké těsto na pizzu, které si můžete vyhledat podle svého gusta.\n2.\tPředehřejte troubu na teplotu 220°C.\n3.\tRozprostřete tenké těsto na pečícím papíru na plechu a potřete ho česnekovým základem. Základ můžete vyrobit tím, že smícháte česnek s olivovým olejem a trochou soli. Poté tímto základem potřete těsto.\n4.\tNa potřené těsto rozložte plátky nebo nastrouhanou mozzarellu.\n5.\tPřidejte bazalkové listy na vrch mozzarelly.\n6.\tPokapávejte olivovým olejem po celém povrchu pizzy.\n7.\tPizzu dejte do předehřáté trouby a pečte ji přibližně 10-15 minut nebo dokud těsto nezačne zlatě hnědnout a sýr se rozpustí a začne lehce hnědnout.\n8.\tVyjměte pizzu z trouby a nechte ji chvíli vychladnout.\n9.\tNakrájejte ji na kousky a podávejte ještě teplou.\nDobrou chuť!\n",
    "imageUrl": "https://www.recipetineats.com/wp-content/uploads/2020/05/Margherita-pizza-overhead.jpg?resize=650,975",
    "preparationLength": 45,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "fc1fb9b9f4766e63",
        "amount": 150,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 100,
        "units": "ml"
      },
      {
        "id": "f02fc2f5d73abeb8",
        "amount": 100,
        "units": "g"
      },
      {
        "id": "197d1ac57738f812",
        "amount": 25,
        "units": "g"
      },
      {
        "id": "1fb3aa7708b7100a",
        "amount": 30,
        "units": "ml"
      }
    ],
    "_id": "82a9ae100f392439"
  },
  {
    "name": "Test Pizza",
    "description": "1.\tPředehřejte troubu na 200 °C.\n2.\tNa pomoučené pracovní ploše rozválejte pizzové těsto do požadované velikosti a přeneste ho na plech vyložený pečícím papírem.\n3.\tRajčatovou omáčku rozetřete po povrchu těsta.\n4.\tNa omáčku přidejte plátky šunky, ananasové kousky, olivy, kukuřici, nakrájenou papriku a cibuli.\n5.\tNa vrch rozložte mozzarellu nebo jiný oblíbený sýr.\n6.\tJemně nakrájejte česnek a rozetřete ho po povrchu pizzy.\n7.\tPosypte pizzu oreganem, bazalkou a sušeným kmínem. Přidejte sůl a pepř dle chuti.\n8.\tPizzu vložte do předehřáté trouby a pečte asi 15-20 minut, nebo dokud těsto nezíská zlatavou barvu a sýr neztuhne.\n9.\tJakmile je pizza hotová, vyjměte ji z trouby a nechte ji lehce vychladnout.\n10.\tNakrájejte na plátky a podávejte ještě teplé.\nToto je jen základní recept na speciální pizzu, ale můžete s ingrediencemi experimentovat a přidat další oblíbené přísady z různých kuchyní světa, jako je například italská saláma, olivy z Řecka, mexický jalapeño nebo indická kari omáčka. Přizpůsobte ji svému vkusu a užijte si tuto výjimečnou pizzu!\n",
    "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRaAZeAvb0SQKr1EYdQaszQMMEmnQcnUyWaCw&usqp=CAU",
    "preparationLength": 90,
    "finalAmount": 1,
    "ingredients": [
      {
        "id": "fc1fb9b9f4766e63",
        "amount": 150,
        "units": "g"
      },
      {
        "id": "c70f74d430932054",
        "amount": 100,
        "units": "ml"
      },
      {
        "id": "f02fc2f5d73abeb8",
        "amount": 100,
        "units": "g"
      },
      {
        "id": "197d1ac57738f812",
        "amount": 25,
        "units": "g"
      },
      {
        "id": "1fb3aa7708b7100a",
        "amount": 30,
        "units": "ml"
      }
    ],
    "_id": "01063b9053bd1603"
  }
]